Repository: wozzall/InterLexic
Catalog: InterLexic/Files/*.lproj/Localizable.strings
Languages: ar

# splashScreenView_name
source: Â©2023 George Worrall
ar: ©2024 George Worrall

# tabView_translate
source: Translate
ar: يترجم

# tabView_flashCards
source: Flashcards
ar: المفضلة

# tabView_about
source: About
ar: عن

# translatorView_textField
source: Type text to translate below.
ar: اكتب النص لترجمته هنا!

# translatorView_languageSelector
source: Which language would you like to translate to?
ar: ما اللغة التي تريد الترجمة إليها؟

# translatorView_translateButton
source: Translate
ar: يترجم

# translatorView_saveButton
source: Save
ar: حفظ

# translatorView_textEditorPlaceholder
source: Type text here to detect language or to translate!
ar: اكتب النص هنا للترجمة!

# translatorView_detected
source: detected! Tap to select!
ar: تم اكتشاف اللغة! انقر لتحديد!

# translatorView_translationSaved
source: Translation saved!
ar: تم حفظ الترجمة!

# languageSelectorView_chooseLanguage
source: Choose a language:
ar: اختر لغة:

# languageSelectorView_from
source: From
ar: من

# languageSelectorView_to
source: To
ar: إلى

# languageSelectorView_detect
source: Detect
ar: يكشف

# cardsView_tap
source: Tap the
ar: اضغط على الزر

# cardsView_tapFinish
source: icon to start translating!
ar: لبدء الترجمة!

# cardsView_noCards
source: No cards found using these filters!
ar: لم يتم العثور على بطاقات تعليمية باستخدام هذه المرشحات!

# cardsView_filterButton
source: Filter
ar: تصفية البحث

# cardsView_hideFilterButton
source: Hide Filter
ar: إخفاء مرشح البحث

# cardsView_clearFilterButton
source: Clear Filter
ar: مسح مرشحات البحث

# cardsView_deleteButton
source: Delete
ar: يمسح

# cardsView_cancelButton
source: Cancel
ar: يلغي

# settingsView_licenses
source: Licenses
ar: التراخيص

# aboutView_sectionTitleDeveloper
source: Developer
ar: مطور

# acknowledgementsView_noDisclaimer
source: No disclaimer available!
ar: لا يوجد إخلاء المسؤولية المتاحة!

# mailError_error
source: Error!
ar: خطأ!

# mailError_noMailClient
source: There is no mail client setup on this device. Please set up Mail and try again!
ar: لا يوجد إعداد عميل بريد على هذا الجهاز. الرجاء إعداد البريد والمحاولة مرة أخرى!

# mailError_dismiss
source: Dismiss
ar: رفض

# tMError_error
source: Error!
ar: خطأ!

# tMError_ok
source: Ok!
ar: نعم!

# tMError_fetchLanguages
source: Unable to fetch supported languages from server. Please try again!
ar: غير قادر على جلب اللغات المدعومة من الخادم. حاول مرة اخرى!

# networkError_error
source: Error!
ar: خطأ!

# networkError_noConnection
source: Unable to connect to the internet! Configure network settings and try again.
ar: غير قادر على الاتصال بالانترنت! قم بتكوين إعدادات الشبكة وحاول مرة أخرى.

# progressView_loading
source: Loading
ar: تحميل

# settings_section_acknowledgements
source: Acknowledgements
ar: شكر وتقدير

# settings_credits
source: Credits
ar: لفة الاعتمادات

# settings_license
source: API License
ar: ترخيص واجهة برمجة التطبيقات
